I would like to add some findings to @shmykyta , we are working on the same issue. 

That happens exclusively when trying to generate a certificate for a subdomain in Google DNS

I did provide custom `recursive_nameservers`

```terraform
data "google_dns_managed_zone" "zone" {
  name = "${var.namespace}-xxx-com"
}

resource "acme_certificate" "global_xxx_certificate" {
  account_key_pem    = acme_registration.reg.account_key_pem
  certificate_request_pem = tls_cert_request.certificate.cert_request_pem
  min_days_remaining = 30
  recursive_nameservers = data.google_dns_managed_zone.zone.name_servers

  dns_challenge {
    provider = "gcloud"
    config = {
      GCE_POLLING_INTERVAL    = "10"
      GCE_PROPAGATION_TIMEOUT = "180"
      GCE_TTL                 = "60"
      GCE_SERVICE_ACCOUNT     = base64decode(data.vault_generic_secret.vault_sa_keys.data["dns_admin"])
      GCE_PROJECT             = var.project_id
    }
  }
  lifecycle {
    create_before_destroy = true
  }
}
```

So we are trying to generate a certificate for a subdomain with namerservers : 

```terraform 
  # module.certificates.acme_certificate.global_xxx_certificate will be created
  + resource "acme_certificate" "global_xxx_certificate" {
      + account_key_pem              = (sensitive value)
      + certificate_domain           = (known after apply)
      + certificate_p12              = (sensitive value)
      + certificate_pem              = (known after apply)
      + certificate_request_pem      = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
xxxx
            -----END CERTIFICATE REQUEST-----
        EOT
      + certificate_url              = (known after apply)
      + disable_complete_propagation = false
      + id                           = (known after apply)
      + issuer_pem                   = (known after apply)
      + key_type                     = "2048"
      + min_days_remaining           = 30
      + must_staple                  = false
      + pre_check_delay              = 0
      + private_key_pem              = (sensitive value)
      + recursive_nameservers        = [
          + "ns-cloud-a1.googledomains.com.",
          + "ns-cloud-a2.googledomains.com.",
          + "ns-cloud-a3.googledomains.com.",
          + "ns-cloud-a4.googledomains.com.",
        ]

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "gcloud"
        }
    }
```

when resolving i see the acme_challange TXT record being properly created in the subdomain and in the logs i see the proper nameservers : 

```
2021-02-08T19:47:00.095-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:00 [DEBUG] lego: AuthURL: https://acme-v02.api.letsencrypt.org/acme/authz-v3/10718652894: timestamp=2021-02-08T19:47:00.094-0800
2021-02-08T19:47:00.095-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:00 [DEBUG] lego:  acme: Could not find solver for: tls-alpn-01: timestamp=2021-02-08T19:47:00.094-0800
2021-02-08T19:47:00.095-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:00 [DEBUG] lego: acme: Could not find solver for: http-01: timestamp=2021-02-08T19:47:00.095-0800
2021-02-08T19:47:00.095-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:00 [DEBUG] lego:  acme: use dns-01 solver: timestamp=2021-02-08T19:47:00.095-0800
2021-02-08T19:47:00.095-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:00 [DEBUG] lego:  acme: Preparing to solve DNS-01: timestamp=2021-02-08T19:47:00.095-0800
2021-02-08T19:47:01.473-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:01 [DEBUG] lego: Wait for apply change [timeout: 30s, interval: 3s]: timestamp=2021-02-08T19:47:01.473-0800
2021-02-08T19:47:01.598-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:01 [DEBUG] lego: acme: Trying to solve DNS-01: timestamp=2021-02-08T19:47:01.598-0800
2021-02-08T19:47:01.598-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:01 [DEBUG] lego:  acme: Checking DNS record propagation using [ns-cloud-a1.googledomains.com.:53 ns-cloud-a2.googledomains.com.:53 ns-cloud-a3.googledomains.com.:53 ns-cloud-a4.googledomains.com.:53]: timestamp=2021-02-08T19:47:01.598-0800
module.certificates.acme_certificate.global_relay_certificate: Still creating... [10s elapsed]
2021-02-08T19:47:11.601-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:47:11 [DEBUG] lego: Wait for propagation [timeout: 3m0s, interval: 10s]: timestamp=2021-02-08T19:47:11.601-0800



module.certificates.acme_certificate.global_relay_certificate: Still creating... [3m10s elapsed]
2021-02-08T19:50:17.006-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:50:17 [DEBUG] lego: acme: Cleaning DNS-01 challenge: timestamp=2021-02-08T19:50:17.005-0800
2021-02-08T19:50:17.813-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:50:17 [DEBUG] lego: retry due to: acme: error: 400 :: POST :: https://acme-v02.api.letsencrypt.org/acme/authz-v3/10718652894 :: urn:ietf:params:acme:error:badNonce :: JWS has an invalid anti-replay nonce: "0103BcV9tG-HBA7W1pCPOefEBQmsoxEyuGnsmi463u1UQd4", url:: timestamp=2021-02-08T19:50:17.813-0800
2021-02-08T19:50:18.128-0800 [INFO]  plugin.terraform-provider-acme_v2.0.0: 2021/02/08 19:50:18 [DEBUG] lego: Deactivating auth: https://acme-v02.api.letsencrypt.org/acme/authz-v3/10718652894: timestamp=2021-02-08T19:50:18.128-0800
2021/02/08 19:50:18 [DEBUG] module.certificates.acme_certificate.global_relay_certificate: apply errored, but we're indicating that via the Error pointer rather than returning it: error creating certificate: error: one or more domains had a problem:
time limit exceeded: last error: NS ns-cloud-e4.googledomains.com. did not return the expected TXT record [fqdn: _acme-challenge.relays.xxx.xxx.com., value: _W2_ibyH2OdqkIuCU1hgETQc54zXuHnV1Yy4SEuR3dQ]:

Error: error creating certificate: error: one or more domains had a problem:
 time limit exceeded: last error: NS ns-cloud-e4.googledomains.com. did not return the expected TXT record [fqdn: _acme-challenge.relays.xxx.xxx.com., value: _W2_ibyH2OdqkIuCU1hgETQc54zXuHnV1Yy4SEuR3dQ]:

```

The error message in the end points to the name servers of the main domain and not to the subdomain , which i suspect is the reason for the error 

